# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

a = int(input('Введите первое челое число: '))
b = int(input('Введите второе челое число: '))
x = a + b
y = a * b

print(f"сумма {x}")
print(f'произведение {y}')

